DataProcessors/мегапрайсИмпортИз77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мегапрайсИмпортИз77</Name>
			<Comment>Мегапрайс: Импорт из 7.7</Comment>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле_Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>350</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Производитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_БазоваяЕдиница</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводительСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УдалитьЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаСправочника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Родитель1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Родитель2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Родитель3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Родитель4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Родитель5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответствияПроизводителей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗагрузитьИсключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле_Производитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводительСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/мегапрайсИмпортИз77/Ext/ObjectModule.bsl
&НаСервере
Процедура УстановитьСоответствияПроизводителей(ТабличнаяЧасть,СоответствияПроизводителей) Экспорт
	
	СпрПроизводители = Справочники.Производители;
	ПустаяСсылка     = СпрПроизводители.ПустаяСсылка();
	ПустаяСсылкаМегапрайс = Справочники.мегапрайсСоответствияПроизводителей.ПустаяСсылка();
	
	Для Каждого Стр Из СоответствияПроизводителей Цикл
		
		Если ЗначениеЗаполнено(Стр.ПроизводительСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСсылкаПроизводитель = ПустаяСсылка;
		
		СтрПоле_Производитель = СокрЛП(Стр.Поле_Производитель);
		
		Попытка
			НайтиСоответствие = Справочники.мегапрайсСоответствияПроизводителей.НайтиПоНаименованию(СтрПоле_Производитель,Истина);
			Если НЕ НайтиСоответствие = ПустаяСсылкаМегапрайс Тогда
				НайденнаяСсылкаПроизводитель = НайтиСоответствие.Производитель; 
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если НайденнаяСсылкаПроизводитель = ПустаяСсылка Тогда
			НайденнаяСсылкаПроизводитель = СпрПроизводители.НайтиПоНаименованию(СтрПоле_Производитель,Истина);
		КонецЕсли;
		
		Если НайденнаяСсылкаПроизводитель = ПустаяСсылка Тогда
			НовыйПроизводитель = СпрПроизводители.СоздатьЭлемент();
			НовыйПроизводитель.Наименование = СтрПоле_Производитель;
			НовыйПроизводитель.Записать();
			
			НайденнаяСсылкаПроизводитель = НовыйПроизводитель.Ссылка;
		КонецЕсли;
				
		Стр.ПроизводительСсылка = НайденнаяСсылкаПроизводитель;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Поле_Производитель",СтрПоле_Производитель);
		НайтиСтроки = ТабличнаяЧасть.НайтиСтроки(Отбор);
		Если НайтиСтроки.Количество() > 0 Тогда
			Для Каждого СтрТаблицы Из НайтиСтроки Цикл
				СтрТаблицы.ПроизводительСсылка = НайденнаяСсылкаПроизводитель;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
